Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ecs_service.memo-ecs-service has changed
~ resource "aws_ecs_service" "memo-ecs-service" {
        id                                 = "arn:aws:ecs:ap-northeast-2:264842458097:service/memo-ecs-cluster/memo-ecs-service"
        name                               = "memo-ecs-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:264842458097:task-definition/memo-ecs-task-definition:12" -> "arn:aws:ecs:ap-northeast-2:264842458097:task-definition/memo-ecs-task-definition:15"
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.memo-ecs-task-definition has been deleted
- resource "aws_ecs_task_definition" "memo-ecs-task-definition" {
      - arn                      = "arn:aws:ecs:ap-northeast-2:264842458097:task-definition/memo-ecs-task-definition:12" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu          = 256
                  - environment  = []
                  - essential    = true
                  - image        = "264842458097.dkr.ecr.ap-northeast-2.amazonaws.com/memo-ecr:60ff002d7bd529810624885e733a9682303f8270"
                  - memory       = 512
                  - mountPoints  = []
                  - name         = "memo-ecs-container"
                  - portMappings = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom  = []
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::264842458097:role/ecs-staging-execution-role" -> null
      - family                   = "memo-ecs-task-definition" -> null
      - id                       = "memo-ecs-task-definition" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 12 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.memo-ecs-service will be updated in-place
~ resource "aws_ecs_service" "memo-ecs-service" {
        id                                 = "arn:aws:ecs:ap-northeast-2:264842458097:service/memo-ecs-cluster/memo-ecs-service"
        name                               = "memo-ecs-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:264842458097:task-definition/memo-ecs-task-definition:15" -> (known after apply)
        # (14 unchanged attributes hidden)





      + timeouts {
          + delete = "10s"
        }
        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.memo-ecs-task-definition will be created
+ resource "aws_ecs_task_definition" "memo-ecs-task-definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 256
                  + essential    = true
                  + image        = "264842458097.dkr.ecr.ap-northeast-2.amazonaws.com/memo-ecr:60ff002d7bd529810624885e733a9682303f8270"
                  + memory       = 512
                  + name         = "memo-ecs-container"
                  + portMappings = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::264842458097:role/ecs-staging-execution-role"
      + family                   = "memo-ecs-task-definition"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
